Revit 2026 API

# WallSweepInfoIsVertical Property

---

Indicates whether the sweep or reveal is swept vertically or horizontally.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsVertical { get; }
```
```vb
Public ReadOnly Property IsVertical As Boolean
	Get
```
```cpp
public:
property bool IsVertical {
	bool get ();
}
```
```fsharp
member IsVertical : bool with get
```

#### Property Value

Boolean

Wall sweeps defined as a part of a vertical compound structure will always be horizontal.

#### Reference

WallSweepInfo Class

Autodesk.Revit.DB Namespace